src/InformationRegisters/UsersSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>UsersSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Value</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.UsersSettings</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Options</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.UsersSettings</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/StandardSubsystemsSecondUse/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// EXPORT PROCEDURES AND FUNCTIONS

// Function returns default value for the passed user and setting.
//
// Parameters:
//  User 		- Program current user
//  Setting     - Flag, for which default value is being returned
//
// Value returned:
//  Default value for the setting.
//
Function GetValueByDefaultUser(User, Options) Export

	Query = New Query;
	Query.SetParameter("User", User);
	Query.SetParameter("Options"   , ChartsOfCharacteristicTypes.UsersSettings[Options]);
	Query.Text = "SELECT
	             |	RegisterValueRight.Value
	             |FROM
	             |	InformationRegister.UsersSettings AS RegisterValueRight
	             |WHERE
	             |	RegisterValueRight.User = &User
	             |	AND RegisterValueRight.Options = &Options";

	Selection  = Query.Execute().Choose();

	EmptyValue = ChartsOfCharacteristicTypes.UsersSettings[Options].ValueType.AdjustValue();

	If Selection.Count() = 0 Then
		
		Return EmptyValue;

	ElsIf Selection.Next() Then

		If NOT ValueIsFilled(Selection.Value) Then
			Return EmptyValue;
		Else
			Return Selection.Value;
		EndIf;

	Else
		Return EmptyValue;

	EndIf;

EndFunction // GetValueByDefaultUser()
